Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.StructuralMaterialType
The structural material type.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralMaterialType,System.Boolean)
Constructs a new instance of a filter to match family instances by structural material type,
with the option to match all families which are not of the given structural material type.
structuralMaterialType:
The structural material type to match.
inverted:
True if the filter should match all family instances which are not of the given structural material type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralMaterialType)
Constructs a new instance of a filter to match family instances that have the given structural material type.
structuralMaterialType:
The structural material type to match.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
A filter used to match family instances that have the given structural material type.
Remarks:
This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements
before the elements are obtained and expanded. Therefore this filter does not have to be
paired with another quick filter to minimize the number of Elements that are expanded.
Since:
2011